In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import re
import os
import fitz
import pytesseract
import io
import PyPDF2
import sys

from pprint import pprint
from PIL import Image
from pdf2image import convert_from_path

import util
import lines
import group
import label
import records
import extract

In [2]:
test_files_dir = ".././test_files/"
test_dfs_dir = test_files_dir + "tesseract_data_frames/"
test_output_dir = test_files_dir + "extracted_indexes/"
test_files = util.list_files(test_files_dir)
test_dfs = util.list_files(test_dfs_dir)
file = test_dfs[2]

indexes_path = "H:\Documents\Indexex\ILO_yearly_indices\\tesseract_data_frames"
indexes_csv = util.list_files(indexes_path, suffix=".csv")
output_dir = "H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes"

display(test_dfs, file)

['.././test_files/tesseract_data_frames/\\LS_index_1920.csv',
 '.././test_files/tesseract_data_frames/\\LS_index_1921.csv',
 '.././test_files/tesseract_data_frames/\\LS_index_1944.csv',
 '.././test_files/tesseract_data_frames/\\LS_index_1976.csv',
 '.././test_files/tesseract_data_frames/\\LS_index_1986.csv',
 '.././test_files/tesseract_data_frames/\\LS_index_1986_split.csv']

'.././test_files/tesseract_data_frames/\\LS_index_1944.csv'

In [28]:
pdf_df = pd.read_csv("H:/Documents/Indexex/ILO_yearly_indices/tesseract_data_frames/\\LS_index_1964.csv")
rec = extract.extract_indexes(pdf_df)
rec

KeyboardInterrupt:

In [46]:
rec.loc[rec["page"]==9]

     country region                                               text  page
67   BELGIUM         10 Dec. Royal Order to amend the consolidated ...     9
68   BELGIUM         46 Dec. Ministerial Order to bring the followi...     9
69    BRAZIL         20 Jan. Decree No. 53453, to institute an obli...     9
70    BRAZIL         9 Apr. Constitutional Act [subject to certain ...     9
71    BRAZIL         1 June Act No. 4330, to regulate the right to ...     9
72    BRAZIL         44 July Decree No. 54018, to reorganise the Na...     9
73    BRAZIL         44 July Act No. 4355, to amend s. 25 of Act No...     9
74    BRAZIL         23 Nov. Order No. 10, to approve a schedule of...     9
75  BULGARIA         7 Mar. Decree No. 105, to supplement the Decre...     9
76  BULGARIA         30 May Decision No. 2, to interpret ss. 178 an...     9
77  BULGARIA            43.8. 1954-—Bul. 2 ... 1963—-Bul. 4.  — 17 —       9

In [4]:
#pdf_df = util.ocr(file, start_page=1, save_to=".././test_files")
pdf_df = pd.read_csv(file)
lines_df = lines.make_lines_df_from_ocr(pdf_df)
bins_x0, bins_x1, x0_n = group.group_line_starts_ends(lines_df)
borders = lines.make_borders_df(bins_x0, bins_x1)

lines_df

,line_text,artifact_text,x0,y0,x1,y1,page,dx
0,INTERNATIONAL LABOUR OFFICE,,144,342,1899,405,1,1755
1,"LEGISLATIVE SERIES, 1944",,137,1363,1897,1512,1,1760
2,INDEXES,,808,2129,1232,2180,1,424
3,"MONTREAL, CANADA",,719,3137,1314,3181,1,595
4,1946,,967,3207,1072,3248,1,105
...,...,...,...,...,...,...,...,...
4163,Apr. 28 L.D. respecting the organisation of la...,,345,2947,2056,2991,82,1711
4164,agreements; labour courts]. No. 311. (Zb. pp. ...,,608,2993,1881,3039,82,1273
4165,G.O. = Gaceta Oficial de los Estados Unidos de...,,351,3081,1649,3126,82,1298
4166,"Zb. = Zbornik sakona 1 naredaba,",,345,3138,1087,3177,82,742
4167,LS. 1940 (Ven. 1).,,348,3239,842,3283,82,494

In [5]:
#rec_df = extract.extract_indexes(pdf_df, save_to=test_output_dir + os.path.basename(file))
rec_df = extract.extract_indexes(pdf_df)
rec_df

,country,region,text,page
0,ARGENTINE REPUBLIC,,"June 3 Decree No. 13,943/44, to repeal section...",3
1,ARGENTINE REPUBLIC,,"Sept. 11 Decrees No. 24,335/44 and 24,336/44, ...",3
2,ARGENTINE REPUBLIC,,"Nov. 4 Decree No. 29,830/44, to amend certain ...",3
3,AUSTRALIA,,"Apr. 6 An Act to,amend the Invalid and Old-age...",3
4,AUSTRALIA,,Dec. 21 Amendment of the National Security (In...,3
...,...,...,...,...
1330,YUGOSLAVIA,Croatia |,Mar. 29 L.D. respecting family allowances for ...,82
1331,YUGOSLAVIA,Croatia |,Apr. 28 L.D. respecting the organisation of la...,82
1332,YUGOSLAVIA,Croatia |,G.O. = Gaceta Oficial de los Estados Unidos de...,82
1333,YUGOSLAVIA,Croatia |,"Zb. = Zbornik sakona 1 naredaba,",82
1334,YUGOSLAVIA,Croatia |,LS. 1940 (Ven. 1).,82

In [7]:
rec_df.loc[rec_df["page"]==9]

,country,region,text,page
72,MOROCCO,and Northern Ireland a,NORWAY (continued) Aug. 24 Act to amend provis...,9
73,MOROCCO,and Northern Ireland a,"i old age pensions’. .(N.L. Part I, p. 408; Pa...",9
74,PANAMA,,"Aug, 22 L.D. No. 55, to make an addition to Pa...",9
75,PORTUGAL,,"Feb. 21 L.D. No. 33,534, to amend section 13 o...",9
76,PORTUGAL,,"June 29 LD: No. 33,744, to issue various provi...",9
77,PORTUGAL,,Jan. 26. Decree to set forth the conditions to...,9
78,PORTUGAL,,Nov. 25 Act to repeal the Act of 9th September...,9
79,SWEDEN,,"Mar. 7 Act No. 79, to amend section 13 (third ...",9
80,SWEDEN,,"Mar. 17 Act No. 92, to continue in. operation ...",9
81,SWEDEN,,"Mar, 17 Act No. 93, to continue in operation (...",9
82,SWEDEN,,SF. = Svensk foérfattningssamling.,9
83,SWEDEN,,L.S. 1936 (Nor. 4); amendments: 1937 (Nor. 5);...,9
84,SWEDEN,,1930 (Nor. 2); amendments: 1932 (Nor. 4); 1933...,9
85,SWEDEN,,(Nor. 2); 1937 (Nor. 1); 1941 (Nor. 1); 1942 (...,9
86,SWEDEN,,"LS. 1935 (Sp. 3, B). Ls 1931 (Sp. 5). — @L.S. ...",9

In [10]:
df = label.assign_types(lines_df, bins_x0, bins_x1, x0_n)
df = label.assign_labels(df, x0_n)

ind_df, p_l, p_g = label.correct_x0_types(df, bins_x0, bins_x1, x0_n)
ind_df = label.assign_labels(ind_df, x0_n)
ind_df = label.approve_correction(df, ind_df, p_l)

ind_df["new_label"] = ind_df["label"]
ind_df = label.improve_country_classification(ind_df)

ind_df = records.extract_records(ind_df)

In [50]:
def group_lines(df, by):
    #d = 4 old value without ocr
    d = 20
    last = "last_" + by
    bins = pd.DataFrame(columns=[by, "lines", last, "count"])
    # Vergleich nicht mit letzten sondern mit vorletztem Wert?
    for index, row in df.iterrows():
        x0 = row[by]
        poss_bin = bins.loc[(bins[last]-d <= x0) & (bins[last]+d >= x0)]

        if poss_bin.empty:
            new_row = pd.DataFrame({
                by: [x0],
                "lines": [index],
                last: x0,
                "count": 1
            })
            bins = pd.concat([new_row, bins.loc[:]]).reset_index(drop=True)
        else:
            display(row.to_frame())
            display(abs(poss_bin[last].copy() - x0))
            #poss_bin = poss_bin.sort_values(by="diff")
            b = bins.iloc[poss_bin.index[-1]]
            display(poss_bin)
            display("Bin", b.to_frame())

            if not type(b[0]) is list:
                b[0] = [b[0]]
                b[1] = [b[1]]

            b[0].append(x0)
            b[1].append(index)
            b[2] = x0
            b[3] += 1

    return bins

In [49]:
b = group_lines(lines_df.loc[lines_df["page"]==9], "x0")
b

                                                             326
line_text      i old age pensions’. .(N.L. Part I, p. 408; Pa...
artifact_text
x0                                                           112
y0                                                           534
x1                                                          1663
y1                                                           597
page                                                           9
dx                                                          1551

1    20
Name: last_x0, dtype: object

   x0 lines last_x0 count
1  92   324      92     1

'Bin'

           1
x0        92
lines    324
last_x0   92
count      1

                                                             327
line_text      Oct. 19 Act to amend [the first paragraph of s...
artifact_text
x0                                                           136
y0                                                           610
x1                                                          1834
y1                                                           665
page                                                           9
dx                                                          1698

0    1
Name: last_x0, dtype: object

    x0 lines last_x0 count
0  137   325     137     1

'Bin'

           0
x0       137
lines    325
last_x0  137
count      1

                                                             329
line_text      sickness insurance”. (N.L. Part I, pp. 475-476...
artifact_text
x0                                                           389
y0                                                           704
x1                                                          1827
y1                                                           759
page                                                           9
dx                                                          1438

0    2
Name: last_x0, dtype: object

    x0 lines last_x0 count
0  391   328     391     1

'Bin'

           0
x0       391
lines    328
last_x0  391
count      1

                                                             331
line_text      Aug, 22 L.D. No. 55, to make an addition to Pa...
artifact_text
x0                                                           117
y0                                                           900
x1                                                          1833
y1                                                           943
page                                                           9
dx                                                          1716

2    19
3     5
Name: last_x0, dtype: object

           x0       lines last_x0 count
2  [137, 136]  [325, 327]     136     2
3   [92, 112]  [324, 326]     112     2

'Bin'

                  3
x0        [92, 112]
lines    [324, 326]
last_x0         112
count             2

                                                             332
line_text      27th April, 1943, respecting social insurance“...
artifact_text
x0                                                           385
y0                                                           946
x1                                                          1835
y1                                                           992
page                                                           9
dx                                                          1450

1    4
Name: last_x0, dtype: object

           x0       lines last_x0 count
1  [391, 389]  [328, 329]     389     2

'Bin'

                  1
x0       [391, 389]
lines    [328, 329]
last_x0         389
count             2

                                                             333
line_text      investments of the Social Insurance Fund. (Gac...
artifact_text
x0                                                           391
y0                                                           992
x1                                                          1830
y1                                                          1040
page                                                           9
dx                                                          1439

1    6
Name: last_x0, dtype: object

                x0            lines last_x0 count
1  [391, 389, 385]  [328, 329, 332]     385     3

'Bin'

                       1
x0       [391, 389, 385]
lines    [328, 329, 332]
last_x0              385
count                  3

                                            334
line_text      August, 1944, No, 9486, p. 5) oo
artifact_text
x0                                          391
y0                                         1034
x1                                         1702
y1                                         1108
page                                          9
dx                                         1311

1    0
Name: last_x0, dtype: object

                     x0                 lines last_x0 count
1  [391, 389, 385, 391]  [328, 329, 332, 333]     391     4

'Bin'

                            1
x0       [391, 389, 385, 391]
lines    [328, 329, 332, 333]
last_x0                   391
count                       4

                    335
line_text      PORTUGAL
artifact_text
x0                   90
y0                 1115
x1                  421
y1                 1169
page                  9
dx                  331

0    1
Name: last_x0, dtype: object

   x0 lines last_x0 count
0  89   330      89     1

'Bin'

           0
x0        89
lines    330
last_x0   89
count      1

                                                             336
line_text      Feb. 21 L.D. No. 33,534, to amend section 13 o...
artifact_text
x0                                                           134
y0                                                          1205
x1                                                          1833
y1                                                          1280
page                                                           9
dx                                                          1699

2     2
3    17
Name: last_x0, dtype: object

               x0            lines last_x0 count
2      [137, 136]       [325, 327]     136     2
3  [92, 112, 117]  [324, 326, 331]     117     3

'Bin'

                       3
x0        [92, 112, 117]
lines    [324, 326, 331]
last_x0              117
count                  3

                                                             337
line_text      April, 1943, respecting minimum wages” [fine f...
artifact_text
x0                                                           389
y0                                                          1267
x1                                                          1831
y1                                                          1352
page                                                           9
dx                                                          1442

1    2
Name: last_x0, dtype: object

                          x0                      lines last_x0 count
1  [391, 389, 385, 391, 391]  [328, 329, 332, 333, 334]     391     5

'Bin'

                                 1
x0       [391, 389, 385, 391, 391]
lines    [328, 329, 332, 333, 334]
last_x0                        391
count                            5

                                                  338
line_text      offence}. (Diario do Govérno, p. 137):
artifact_text
x0                                                389
y0                                               1301
x1                                               1247
y1                                               1389
page                                                9
dx                                                858

1    0
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389]","[328, 329, 332, 333, 334, 337]",389,6

'Bin'

                                      1
x0       [391, 389, 385, 391, 391, 389]
lines    [328, 329, 332, 333, 334, 337]
last_x0                             389
count                                 6

                                                             339
line_text      June 29 LD: No. 33,744, to issue various provi...
artifact_text
x0                                                           134
y0                                                          1385
x1                                                          1833
y1                                                          1455
page                                                           9
dx                                                          1699

2    2
3    0
Name: last_x0, dtype: object

                    x0                 lines last_x0 count
2           [137, 136]            [325, 327]     136     2
3  [92, 112, 117, 134]  [324, 326, 331, 336]     134     4

'Bin'

                            3
x0        [92, 112, 117, 134]
lines    [324, 326, 331, 336]
last_x0                   134
count                       4

                                                             340
line_text      relating to labour dues and te amend..... sect...
artifact_text
x0                                                           392
y0                                                          1425
x1                                                          1831
y1                                                          1494
page                                                           9
dx                                                          1439

1    3
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389]","[328, 329, 332, 333, 334, 337, 338]",389,7

'Bin'

                                           1
x0       [391, 389, 385, 391, 391, 389, 389]
lines    [328, 329, 332, 333, 334, 337, 338]
last_x0                                  389
count                                      7

                                                             341
line_text      No. 32,749 of 15th April, 1943, respecting: mi...
artifact_text
x0                                                           391
y0                                                          1486
x1                                                          1833
y1                                                          1532
page                                                           9
dx                                                          1442

1    1
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392]","[328, 329, 332, 333, 334, 337, 338, 340]",392,8

'Bin'

                                                1
x0       [391, 389, 385, 391, 391, 389, 389, 392]
lines    [328, 329, 332, 333, 334, 337, 338, 340]
last_x0                                       392
count                                           8

                                                             342
line_text      the sole subsection of section 34 of L.D. No. ...
artifact_text
x0                                                           391
y0                                                          1516
x1                                                          1831
y1                                                          1577
page                                                           9
dx                                                          1440

1    0
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391]","[328, 329, 332, 333, 334, 337, 338, 340, 341]",391,9

'Bin'

                                                     1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391]
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341]
last_x0                                            391
count                                                9

                                                             343
line_text      1944, respecting family allowances], (Diario d...
artifact_text
x0                                                           393
y0                                                          1557
x1                                                          1833
y1                                                          1624
page                                                           9
dx                                                          1440

1    2
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",391,10

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                391
count                                                   10

                                                      344
line_text      587-5B8 ; erratum: D.G. 1945, p. 91) ee ee
artifact_text
x0                                                    392
y0                                                   1605
x1                                                   1826
y1                                                   1665
page                                                    9
dx                                                   1434

1    1
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",393,11

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                393
count                                                   11

                                                             345
line_text      Jan. 26. Decree to set forth the conditions to...
artifact_text
x0                                                           136
y0                                                          1809
x1                                                          1834
y1                                                          1861
page                                                           9
dx                                                          1698

2    0
3    2
Name: last_x0, dtype: object

                         x0                      lines last_x0 count
2                [137, 136]                 [325, 327]     136     2
3  [92, 112, 117, 134, 134]  [324, 326, 331, 336, 339]     134     5

'Bin'

                                 3
x0        [92, 112, 117, 134, 134]
lines    [324, 326, 331, 336, 339]
last_x0                        134
count                            5

                                                             346
line_text      oe terminating operations in undertakings [rep...
artifact_text
x0                                                            93
y0                                                          1824
x1                                                          1833
y1                                                          1904
page                                                           9
dx                                                          1740

0    3
Name: last_x0, dtype: object

         x0       lines last_x0 count
0  [89, 90]  [330, 335]      90     2

'Bin'

                  0
x0         [89, 90]
lines    [330, 335]
last_x0          90
count             2

                                                             347
line_text      November, 1935, respecting the dismissal of em...
artifact_text                                                  ‘
x0                                                           380
y0                                                          1897
x1                                                          1834
y1                                                          1946
page                                                           9
dx                                                          1454

1    12
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",392,12

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                392
count                                                   12

                                                             348
line_text      shortage of work®], (Boletin oficial del Estad...
artifact_text
x0                                                           389
y0                                                          1928
x1                                                          1831
y1                                                          2032
page                                                           9
dx                                                          1442

1    9
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",380,13

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                380
count                                                   13

                                  349
line_text      1944, pp. 1087-1089) ,
artifact_text
x0                                393
y0                               1989
x1                                974
y1                               2032
page                                9
dx                                581

1    4
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",389,14

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                389
count                                                   14

                                                             350
line_text      Nov. 25 Act to repeal the Act of 9th September...
artifact_text
x0                                                           137
y0                                                          2065
x1                                                          1834
y1                                                          2111
page                                                           9
dx                                                          1697

2    1
3    1
Name: last_x0, dtype: object

                              x0                           lines last_x0 count
2                     [137, 136]                      [325, 327]     136     2
3  [92, 112, 117, 134, 134, 136]  [324, 326, 331, 336, 339, 345]     136     6

'Bin'

                                      3
x0        [92, 112, 117, 134, 134, 136]
lines    [324, 326, 331, 336, 339, 345]
last_x0                             136
count                                 6

                                                             351
line_text      Tes ‘of 25th May, 1931, to set up the National...
artifact_text
x0                                                            92
y0                                                          2092
x1                                                          1831
y1                                                          2160
page                                                           9
dx                                                          1739

0    1
Name: last_x0, dtype: object

             x0            lines last_x0 count
0  [89, 90, 93]  [330, 335, 346]      93     3

'Bin'

                       0
x0          [89, 90, 93]
lines    [330, 335, 346]
last_x0               93
count                  3

                                                             352
line_text      (Boletin Oficial del: Estado, ‘27th November, ...
artifact_text
x0                                                           395
y0                                                          2140
x1                                                          1629
y1                                                          2217
page                                                           9
dx                                                          1234

1    2
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",393,15

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                393
count                                                   15

                  353
line_text      SWEDEN
artifact_text
x0                 90
y0               2248
x1                356
y1               2305
page                9
dx                266

0    2
Name: last_x0, dtype: object

                 x0                 lines last_x0 count
0  [89, 90, 93, 92]  [330, 335, 346, 351]      92     4

'Bin'

                            0
x0           [89, 90, 93, 92]
lines    [330, 335, 346, 351]
last_x0                    92
count                       4

                                                             354
line_text      Mar. 7 Act No. 79, to amend section 13 (third ...
artifact_text                                                  ;
x0                                                           137
y0                                                          2321
x1                                                          1835
y1                                                          2392
page                                                           9
dx                                                          1698

2    1
3    0
Name: last_x0, dtype: object

,x0,lines,last_x0,count
2,"[137, 136]","[325, 327]",136,2
3,"[92, 112, 117, 134, 134, 136, 137]","[324, 326, 331, 336, 339, 345, 350]",137,7

'Bin'

                                           3
x0        [92, 112, 117, 134, 134, 136, 137]
lines    [324, 326, 331, 336, 339, 345, 350]
last_x0                                  137
count                                      7

                                                             355
line_text      Hours of Work Act of 30th September, 1938 (No....
artifact_text
x0                                                           392
y0                                                          2373
x1                                                          1834
y1                                                          2435
page                                                           9
dx                                                          1442

1    3
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",395,16

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                395
count                                                   16

                                                             356
line_text      to time off duty in return for overtime work]....
artifact_text
x0                                                           393
y0                                                          2432
x1                                                          1761
y1                                                          2507
page                                                           9
dx                                                          1368

1    1
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",392,17

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                392
count                                                   17

                                                             357
line_text      Mar. 17 Act No. 92, to continue in. operation ...
artifact_text
x0                                                           138
y0                                                          2489
x1                                                          1835
y1                                                          2596
page                                                           9
dx                                                          1697

2    2
3    1
Name: last_x0, dtype: object

,x0,lines,last_x0,count
2,"[137, 136]","[325, 327]",136,2
3,"[92, 112, 117, 134, 134, 136, 137, 137]","[324, 326, 331, 336, 339, 345, 350, 354]",137,8

'Bin'

                                                3
x0        [92, 112, 117, 134, 134, 136, 137, 137]
lines    [324, 326, 331, 336, 339, 345, 350, 354]
last_x0                                       137
count                                           8

                                                             358
line_text      934 of 30th December, 1939, respecting liabili...
artifact_text
x0                                                           391
y0                                                          2557
x1                                                          1833
y1                                                          2639
page                                                           9
dx                                                          1442

1    2
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",393,18

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                393
count                                                   18

                   359
line_text      p. 257)
artifact_text
x0                 391
y0                2604
x1                 528
y1                2648
page                 9
dx                 137

1    0
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",391,19

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                391
count                                                   19

                                                             360
line_text      Mar, 17 Act No. 93, to continue in operation (...
artifact_text
x0                                                           138
y0                                                          2641
x1                                                          1835
y1                                                          2733
page                                                           9
dx                                                          1697

2    2
3    0
Name: last_x0, dtype: object

,x0,lines,last_x0,count
2,"[137, 136]","[325, 327]",136,2
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138]","[324, 326, 331, 336, 339, 345, 350, 354, 357]",138,9

'Bin'

                                                     3
x0        [92, 112, 117, 134, 134, 136, 137, 137, 138]
lines    [324, 326, 331, 336, 339, 345, 350, 354, 357]
last_x0                                            138
count                                                9

                                                             361
line_text      No. 935 of 30th December, 1939, to extend in c...
artifact_text
x0                                                           393
y0                                                          2709
x1                                                          1834
y1                                                          2766
page                                                           9
dx                                                          1441

1    2
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",391,20

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                391
count                                                   20

                                                             362
line_text      the application of Act No. 245 of 28th May, 19...
artifact_text
x0                                                           393
y0                                                          2754
x1                                                          1837
y1                                                          2815
page                                                           9
dx                                                          1444

1    0
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",393,21

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                393
count                                                   21

                                                           363
line_text      conciliation in labour disputes®. (S.F. p. 257)
artifact_text
x0                                                         389
y0                                                        2813
x1                                                        1453
y1                                                        2860
page                                                         9
dx                                                        1064

1    4
Name: last_x0, dtype: object

,x0,lines,last_x0,count
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",393,22

'Bin'

                                                         1
x0       [391, 389, 385, 391, 391, 389, 389, 392, 391, ...
lines    [328, 329, 332, 333, 334, 337, 338, 340, 341, ...
last_x0                                                393
count                                                   22

                                              364
line_text      SF. = Svensk foérfattningssamling.
artifact_text
x0                                            120
y0                                           2913
x1                                            886
y1                                           2965
page                                            9
dx                                            766

2    16
3    18
Name: last_x0, dtype: object

,x0,lines,last_x0,count
2,"[137, 136]","[325, 327]",136,2
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138, 138]","[324, 326, 331, 336, 339, 345, 350, 354, 357, ...",138,10

'Bin'

                                                         3
x0       [92, 112, 117, 134, 134, 136, 137, 137, 138, 138]
lines    [324, 326, 331, 336, 339, 345, 350, 354, 357, ...
last_x0                                                138
count                                                   10

                                                             365
line_text      L.S. 1936 (Nor. 4); amendments: 1937 (Nor. 5);...
artifact_text                                                  *
x0                                                           104
y0                                                          3008
x1                                                          1837
y1                                                          3093
page                                                           9
dx                                                          1733

0    14
3    16
Name: last_x0, dtype: object

,x0,lines,last_x0,count
0,"[89, 90, 93, 92, 90]","[330, 335, 346, 351, 353]",90,5
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138, 1...","[324, 326, 331, 336, 339, 345, 350, 354, 357, ...",120,11

'Bin'

                                                         3
x0       [92, 112, 117, 134, 134, 136, 137, 137, 138, 1...
lines    [324, 326, 331, 336, 339, 345, 350, 354, 357, ...
last_x0                                                120
count                                                   11

                                                             366
line_text      1930 (Nor. 2); amendments: 1932 (Nor. 4); 1933...
artifact_text
x0                                                            94
y0                                                          3065
x1                                                          1834
y1                                                          3132
page                                                           9
dx                                                          1740

0     4
3    10
Name: last_x0, dtype: object

,x0,lines,last_x0,count
0,"[89, 90, 93, 92, 90]","[330, 335, 346, 351, 353]",90,5
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138, 1...","[324, 326, 331, 336, 339, 345, 350, 354, 357, ...",104,12

'Bin'

                                                         3
x0       [92, 112, 117, 134, 134, 136, 137, 137, 138, 1...
lines    [324, 326, 331, 336, 339, 345, 350, 354, 357, ...
last_x0                                                104
count                                                   12

                                                             367
line_text      (Nor. 2); 1937 (Nor. 1); 1941 (Nor. 1); 1942 (...
artifact_text
x0                                                            94
y0                                                          3116
x1                                                          1699
y1                                                          3180
page                                                           9
dx                                                          1605

0    4
3    0
Name: last_x0, dtype: object

,x0,lines,last_x0,count
0,"[89, 90, 93, 92, 90]","[330, 335, 346, 351, 353]",90,5
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138, 1...","[324, 326, 331, 336, 339, 345, 350, 354, 357, ...",94,13

'Bin'

                                                         3
x0       [92, 112, 117, 134, 134, 136, 137, 137, 138, 1...
lines    [324, 326, 331, 336, 339, 345, 350, 354, 357, ...
last_x0                                                 94
count                                                   13

                                                             368
line_text      SES. 1943 (Pan. 1). *°L.S. 1943 (Por. 1). — 71...
artifact_text
x0                                                           136
y0                                                          3161
x1                                                          1755
y1                                                          3264
page                                                           9
dx                                                          1619

2    0
Name: last_x0, dtype: object

           x0       lines last_x0 count
2  [137, 136]  [325, 327]     136     2

'Bin'

                  2
x0       [137, 136]
lines    [325, 327]
last_x0         136
count             2

                                                             369
line_text      LS. 1935 (Sp. 3, B). Ls 1931 (Sp. 5). — @L.S. ...
artifact_text                                                  “
x0                                                           108
y0                                                          3200
x1                                                          1629
y1                                                          3269
page                                                           9
dx                                                          1521

0    18
3    14
Name: last_x0, dtype: object

,x0,lines,last_x0,count
0,"[89, 90, 93, 92, 90]","[330, 335, 346, 351, 353]",90,5
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138, 1...","[324, 326, 331, 336, 339, 345, 350, 354, 357, ...",94,14

'Bin'

                                                         3
x0       [92, 112, 117, 134, 134, 136, 137, 137, 138, 1...
lines    [324, 326, 331, 336, 339, 345, 350, 354, 357, ...
last_x0                                                 94
count                                                   14

                                                             370
line_text      TS. 1939 (Swe. 8). —*L.S. 1920 (Swe. 6); amend...
artifact_text                                                  "
x0                                                           152
y0                                                          3248
x1                                                          1833
y1                                                          3316
page                                                           9
dx                                                          1681

2    16
Name: last_x0, dtype: object

                x0            lines last_x0 count
2  [137, 136, 136]  [325, 327, 368]     136     3

'Bin'

                       2
x0       [137, 136, 136]
lines    [325, 327, 368]
last_x0              136
count                  3

,x0,lines,last_x0,count
0,"[89, 90, 93, 92, 90]","[330, 335, 346, 351, 353]",90,5
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",389,23
2,"[137, 136, 136, 152]","[325, 327, 368, 370]",152,4
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138, 1...","[324, 326, 331, 336, 339, 345, 350, 354, 357, ...",108,15
4,1526,323,1526,1

In [12]:
bins_x0.loc[bins_x0["page"]==9]

,x0,lines,last_x0,count,page
0,"[89, 90, 93, 92, 90]","[330, 335, 346, 351, 353]",90,5,9
3,"[92, 112, 117, 134, 134, 136, 137, 137, 138, 1...","[324, 326, 331, 336, 339, 345, 350, 354, 357, ...",108,15,9
1,"[391, 389, 385, 391, 391, 389, 389, 392, 391, ...","[328, 329, 332, 333, 334, 337, 338, 340, 341, ...",389,23,9

In [11]:
df.loc[df["page"]==9]

,line_text,artifact_text,x0,y0,x1,y1,page,dx,x0_type,x1_type,label
323,g 1944—-Indexes I,——,1526,313,1839,347,9,313,-1,2,other
324,NORWAY (continued),,92,400,692,455,9,600,1,0,start
325,Aug. 24 Act to amend provisionally the Act of ...,,137,489,1835,560,9,1698,-1,2,other
326,"i old age pensions’. .(N.L. Part I, p. 408; Pa...",,112,534,1663,597,9,1551,1,1,start
327,Oct. 19 Act to amend [the first paragraph of s...,,136,610,1834,665,9,1698,-1,2,other
328,"April, 1942, to supplement the Act of 6th June...",,391,664,1833,744,9,1442,2,2,middle
329,"sickness insurance”. (N.L. Part I, pp. 475-476...",,389,704,1827,759,9,1438,2,2,middle
330,PANAMA,,89,796,353,840,9,264,0,0,country
331,"Aug, 22 L.D. No. 55, to make an addition to Pa...",,117,900,1833,943,9,1716,1,2,start
332,"27th April, 1943, respecting social insurance“...",,385,946,1835,992,9,1450,2,2,middle
333,investments of the Social Insurance Fund. (Gac...,,391,992,1830,1040,9,1439,2,2,middle
334,"August, 1944, No, 9486, p. 5) oo",,391,1034,1702,1108,9,1311,2,1,end
335,PORTUGAL,,90,1115,421,1169,9,331,0,0,country
336,"Feb. 21 L.D. No. 33,534, to amend section 13 o...",,134,1205,1833,1280,9,1699,1,2,start
337,"April, 1943, respecting minimum wages” [fine f...",,389,1267,1831,1352,9,1442,2,2,middle
338,"offence}. (Diario do Govérno, p. 137):",,389,1301,1247,1389,9,858,2,0,end
339,"June 29 LD: No. 33,744, to issue various provi...",,134,1385,1833,1455,9,1699,1,2,start
340,relating to labour dues and te amend..... sect...,,392,1425,1831,1494,9,1439,2,2,middle
341,"No. 32,749 of 15th April, 1943, respecting: mi...",,391,1486,1833,1532,9,1442,2,2,middle
342,the sole subsection of section 34 of L.D. No. ...,,391,1516,1831,1577,9,1440,2,2,middle
343,"1944, respecting family allowances], (Diario d...",,393,1557,1833,1624,9,1440,2,2,middle
344,"587-5B8 ; erratum: D.G. 1945, p. 91) ee ee",,392,1605,1826,1665,9,1434,2,2,middle
345,Jan. 26. Decree to set forth the conditions to...,,136,1809,1834,1861,9,1698,1,2,start
346,oe terminating operations in undertakings [rep...,,93,1824,1833,1904,9,1740,0,2,other
347,"November, 1935, respecting the dismissal of em...",‘,380,1897,1834,1946,9,1454,2,2,middle
348,"shortage of work®], (Boletin oficial del Estad...",,389,1928,1831,2032,9,1442,2,2,middle
349,"1944, pp. 1087-1089) ,",,393,1989,974,2032,9,581,2,0,end
350,Nov. 25 Act to repeal the Act of 9th September...,,137,2065,1834,2111,9,1697,1,2,start
351,"Tes ‘of 25th May, 1931, to set up the National...",,92,2092,1831,2160,9,1739,0,2,other
352,"(Boletin Oficial del: Estado, ‘27th November, ...",,395,2140,1629,2217,9,1234,2,1,end
353,SWEDEN,,90,2248,356,2305,9,266,0,0,country
354,"Mar. 7 Act No. 79, to amend section 13 (third ...",;,137,2321,1835,2392,9,1698,1,2,start
355,"Hours of Work Act of 30th September, 1938 (No....",,392,2373,1834,2435,9,1442,2,2,middle
356,to time off duty in return for overtime work]....,,393,2432,1761,2507,9,1368,2,1,end
357,"Mar. 17 Act No. 92, to continue in. operation ...",,138,2489,1835,2596,9,1697,1,2,start
358,"934 of 30th December, 1939, respecting liabili...",,391,2557,1833,2639,9,1442,2,2,middle
359,p. 257),,391,2604,528,2648,9,137,2,0,end
360,"Mar, 17 Act No. 93, to continue in operation (...",,138,2641,1835,2733,9,1697,1,2,start
361,"No. 935 of 30th December, 1939, to extend in c...",,393,2709,1834,2766,9,1441,2,2,middle
362,"the application of Act No. 245 of 28th May, 19...",,393,2754,1837,2815,9,1444,2,2,middle
363,conciliation in labour disputes®. (S.F. p. 257),,389,2813,1453,2860,9,1064,2,1,end
364,SF. = Svensk foérfattningssamling.,,120,2913,886,2965,9,766,1,0,start
365,L.S. 1936 (Nor. 4); amendments: 1937 (Nor. 5);...,*,104,3008,1837,3093,9,1733,1,2,start
366,1930 (Nor. 2); amendments: 1932 (Nor. 4); 1933...,,94,3065,1834,3132,9,1740,1,2,start
367,(Nor. 2); 1937 (Nor. 1); 1941 (Nor. 1); 1942 (...,,94,3116,1699,3180,9,1605,1,1,start
368,SES. 1943 (Pan. 1). *°L.S. 1943 (Por. 1). — 71...,,136,3161,1755,3264,9,1619,-1,1,other
369,"LS. 1935 (Sp. 3, B). Ls 1931 (Sp. 5). — @L.S. ...",“,108,3200,1629,3269,9,1521,1,1,start
370,TS. 1939 (Swe. 8). —*L.S. 1920 (Swe. 6); amend...,"""",152,3248,1833,3316,9,1681,-1,2,other

In [36]:
ind_df.loc[ind_df["page"]==8]

,country,region,text,page
62,FRANCE,,1944--Indexes I — 3 —,8
63,INDIA,,Oct. 7 -An Ordinance further to amend the Nati...,8
64,INDIA,,Dec... 18 | An Ordinance to amend the War Inju...,8
65,INDIA,,"Dec: 30 Notification No. 5-DC (87)/44, to inse...",8
66,MEXICO UNITED STATES OF,,Nov. 4 Decree to amend section 135 [procedure ...,8
67,MOROCCO,,May 1 Decree to amend [sections 21 and 25 of] ...,8
68,MOROCCO,,Dec. 15. An Act to ‘make proyision with respec...,8
69,MOROCCO,and Northern Ireland a,Mar. 30 Act to amend: ‘Provisionally: the ‘Act...,8
70,MOROCCO,and Northern Ireland a,"26, Act No. XVI). — “LS. 1942 (Ind. 1, C). “LS...",8
71,MOROCCO,and Northern Ireland a,"11). Pars, 1944 (N.Z. 3). — “Extracts: L.S. 19...",8

In [8]:
def make_lines_df_from_ocr(pdf_df):
    df = pdf_df.copy()

    df = df.dropna(subset=["text"])
    df = df.rename(columns={"left": "x0", "top": "y0"})
    df["x1"] = df["x0"] + df["width"]
    df["y1"] = df["y0"] + df["height"]
    reg_art = "^\W+(?<!\()"

    page, lines_text, x0, x1, y0, y1 = [], [], [], [], [], []
    art = []

    for p_no, page_frame in df.groupby("page_num"):
        for b, block in page_frame.groupby("block_num"):
            for p, par in block.groupby("par_num"):
                for no, line in par.groupby("line_num"):
                    
                    art_text = ""
                    artifact_start = True
                    
                    line_text = ""
                    l_x0 = 0
                    l_y0 = 0
                    
                    for i, word in line.iterrows():
                        
                        if artifact_start:
                            a = re.search(reg_art, word["text"])
                            if a != None:
                                art_text += a.group()
                                rest = re.sub(reg_art, "", word["text"])
                                
                                if len(rest.strip()) == 0:
                                    if i+1 in line.index:
                                        l_x0 = line.loc[i+1]["x0"]
                                        l_y0 = line.loc[i+1]["y0"]
                                else:
                                    line_text += rest + " "
                                    word_len = len(word["text"])
                                    art_len = len(art_text)/2
                                    l_x0 = int(word["x0"] + (word["x1"] - word["x0"]) * art_len/word_len)
                                
                                continue
                                
                            artifact_start = False
                            if l_x0 == 0:
                                l_x0 = word["x0"]
                                                
                        line_text += word["text"] + " "
                        
                    line_text = line_text.strip()

                    l_x1 = line["x1"].max()
                    l_y0 = line["y0"].min()
                    l_y1 = line["y1"].max()

                    if len(line_text) > 2:
                        art.append(art_text)
                        lines_text.append(line_text)
                        page.append(p_no)
                        x0.append(l_x0)
                        x1.append(l_x1)
                        y0.append(l_y0)
                        y1.append(l_y1)

    lines_df = pd.DataFrame({
        "line_text": lines_text,
        "artifact_text": art,
        "x0": x0,
        "y0": y0,
        "x1": x1,
        "y1": y1,
        "page": page
    })
    lines_df["dx"] = lines_df["x1"] - lines_df["x0"]

    return lines_df

In [9]:
df = make_lines_df_from_ocr(pdf_df)
df.loc[df["page"]==9]

,line_text,artifact_text,x0,y0,x1,y1,page,dx
323,g 1944—-Indexes I,——,1526,313,1839,347,9,313
324,NORWAY (continued),,92,400,692,455,9,600
325,Aug. 24 Act to amend provisionally the Act of ...,,137,489,1835,560,9,1698
326,"i old age pensions’. .(N.L. Part I, p. 408; Pa...",,112,534,1663,597,9,1551
327,Oct. 19 Act to amend [the first paragraph of s...,,136,610,1834,665,9,1698
328,"April, 1942, to supplement the Act of 6th June...",,391,664,1833,744,9,1442
329,"sickness insurance”. (N.L. Part I, pp. 475-476...",,389,704,1827,759,9,1438
330,PANAMA,,89,796,353,840,9,264
331,"Aug, 22 L.D. No. 55, to make an addition to Pa...",,117,900,1833,943,9,1716
332,"27th April, 1943, respecting social insurance“...",,385,946,1835,992,9,1450
333,investments of the Social Insurance Fund. (Gac...,,391,992,1830,1040,9,1439
334,"August, 1944, No, 9486, p. 5) oo",,391,1034,1702,1108,9,1311
335,PORTUGAL,,90,1115,421,1169,9,331
336,"Feb. 21 L.D. No. 33,534, to amend section 13 o...",,134,1205,1833,1280,9,1699
337,"April, 1943, respecting minimum wages” [fine f...",,389,1267,1831,1352,9,1442
338,"offence}. (Diario do Govérno, p. 137):",,389,1301,1247,1389,9,858
339,"June 29 LD: No. 33,744, to issue various provi...",,134,1385,1833,1455,9,1699
340,relating to labour dues and te amend..... sect...,,392,1425,1831,1494,9,1439
341,"No. 32,749 of 15th April, 1943, respecting: mi...",,391,1486,1833,1532,9,1442
342,the sole subsection of section 34 of L.D. No. ...,,391,1516,1831,1577,9,1440
343,"1944, respecting family allowances], (Diario d...",,393,1557,1833,1624,9,1440
344,"587-5B8 ; erratum: D.G. 1945, p. 91) ee ee",,392,1605,1826,1665,9,1434
345,Jan. 26. Decree to set forth the conditions to...,,136,1809,1834,1861,9,1698
346,oe terminating operations in undertakings [rep...,,93,1824,1833,1904,9,1740
347,"November, 1935, respecting the dismissal of em...",‘,380,1897,1834,1946,9,1454
348,"shortage of work®], (Boletin oficial del Estad...",,389,1928,1831,2032,9,1442
349,"1944, pp. 1087-1089) ,",,393,1989,974,2032,9,581
350,Nov. 25 Act to repeal the Act of 9th September...,,137,2065,1834,2111,9,1697
351,"Tes ‘of 25th May, 1931, to set up the National...",,92,2092,1831,2160,9,1739
352,"(Boletin Oficial del: Estado, ‘27th November, ...",,395,2140,1629,2217,9,1234
353,SWEDEN,,90,2248,356,2305,9,266
354,"Mar. 7 Act No. 79, to amend section 13 (third ...",;,137,2321,1835,2392,9,1698
355,"Hours of Work Act of 30th September, 1938 (No....",,392,2373,1834,2435,9,1442
356,to time off duty in return for overtime work]....,,393,2432,1761,2507,9,1368
357,"Mar. 17 Act No. 92, to continue in. operation ...",,138,2489,1835,2596,9,1697
358,"934 of 30th December, 1939, respecting liabili...",,391,2557,1833,2639,9,1442
359,p. 257),,391,2604,528,2648,9,137
360,"Mar, 17 Act No. 93, to continue in operation (...",,138,2641,1835,2733,9,1697
361,"No. 935 of 30th December, 1939, to extend in c...",,393,2709,1834,2766,9,1441
362,"the application of Act No. 245 of 28th May, 19...",,393,2754,1837,2815,9,1444
363,conciliation in labour disputes®. (S.F. p. 257),,389,2813,1453,2860,9,1064
364,SF. = Svensk foérfattningssamling.,,120,2913,886,2965,9,766
365,L.S. 1936 (Nor. 4); amendments: 1937 (Nor. 5);...,*,104,3008,1837,3093,9,1733
366,1930 (Nor. 2); amendments: 1932 (Nor. 4); 1933...,,94,3065,1834,3132,9,1740
367,(Nor. 2); 1937 (Nor. 1); 1941 (Nor. 1); 1942 (...,,94,3116,1699,3180,9,1605
368,SES. 1943 (Pan. 1). *°L.S. 1943 (Por. 1). — 71...,,136,3161,1755,3264,9,1619
369,"LS. 1935 (Sp. 3, B). Ls 1931 (Sp. 5). — @L.S. ...",“,108,3200,1629,3269,9,1521
370,TS. 1939 (Swe. 8). —*L.S. 1920 (Swe. 6); amend...,"""",152,3248,1833,3316,9,1681

In [ ]:
bins_x0, bins_x1, x0_n = group.group_line_starts_ends(df)
borders = lines.make_borders_df(bins_x0, bins_x1)

In [121]:
pdf_df

,level,page_num,block_num,par_num,line_num,word_num,left,top,width,height,conf,text
0,1,1,0,0,0,0,0,0,2164,3591,-1.000000,NaN
1,2,1,1,0,0,0,144,342,1755,63,-1.000000,NaN
2,3,1,1,1,0,0,144,342,1755,63,-1.000000,NaN
3,4,1,1,1,1,0,144,342,1755,63,-1.000000,NaN
4,5,1,1,1,1,1,144,344,804,61,95.391365,INTERNATIONAL
...,...,...,...,...,...,...,...,...,...,...,...,...
45894,4,82,18,1,1,0,348,3239,494,44,-1.000000,NaN
45895,5,82,18,1,1,1,348,3239,136,36,52.680161,LS.
45896,5,82,18,1,1,2,519,3241,88,36,95.030609,1940
45897,5,82,18,1,1,3,641,3241,113,42,95.085655,(Ven.
45898,5,82,18,1,1,4,788,3242,54,41,96.398392,1).

In [76]:
lines_df.loc[lines_df["page"]==8]

,line_text,x0,y0,x1,y1,page,dx
278,1944--Indexes I — 3 —,357,294,1322,333,8,965
279,INDIA (continued),365,385,880,440,8,515
280,Oct. 7 -An Ordinance further to amend the Nati...,416,477,2116,525,8,1700
281,"Personnel) Ordinance, 1940°. No. XLVII of 1944...",663,523,2117,575,8,1454
282,. vice (Technical Personnel) Amendment Ordinan...,636,551,2117,617,8,1481
283,"ordinary, 7th October, 1944, p. 11438)",673,608,1493,679,8,820
284,Dec... 18 | An Ordinance to amend the War Inju...,413,663,2116,737,8,1703
285,"; ance) Act, 1943. No. LIV of 1944. War Injuri...",492,736,2118,784,8,1626
286,"Insurance) Amendment Ordinance, 1944.. (G.I. E...",669,761,2121,829,8,1452
287,"December, 1944, pp. 1555-1556)",672,825,1338,872,8,666
288,", “Dec: 30 Notification No. 5-DC (87)/44, to i...",352,876,2113,951,8,1761
289,a after sub-rule (1) of Rule 81A of the Defenc...,437,947,2120,992,8,1683
290,(avoidance of ‘strikes and lockouts). (G.I. Pa...,679,988,2112,1065,8,1433
291,"MEXICO, UNITED STATES OF",368,1045,1262,1153,8,894
292,H,1434,1069,1443,1097,8,9
293,¥,1807,1136,1825,1155,8,18
294,Nov. 4 Decree to amend section 135 [procedure ...,416,1180,2112,1229,8,1696
295,’ of the Social Insutance: Act®. (Diario Ofici...,403,1220,2118,1293,8,1715
296,"No. 20, p 0 .",676,1264,1179,1341,8,503
297,MOROCCO,368,1319,690,1392,8,322
298,"] FRENCH, ZONE Looe f",500,1372,1850,1484,8,1350
299,May 1 Decree to amend [sections 21 and 25 of] ...,416,1467,2121,1551,8,1705
300,"Decree of 25th June, 1927 respecting liability...",676,1536,2118,1599,8,1442
301,with which workers meet in the course of their...,672,1585,2121,1632,8,1449
302,"(Bulletin officiel, 2nd June, 1944, No. 1649, ...",680,1627,1775,1716,8,1095
303,NEW. ZEALAND | 7 :,361,1695,1742,1807,8,1381
304,"“Dec, 12, “An Act” to: 5 dmend certain. enactm...",376,1755,2121,1860,8,1745
305,"' New Zealaid* (inter alia, the’ Annual Holida...",621,1836,2118,1890,8,1497
306,"Act, 1925"", the Factories Act, 1921-22"", the I...",677,1875,2120,1934,8,1443
307,": .-and Arbitration Act, 1925"", the. Workers’ ...",596,1916,2118,1978,8,1522
308,and -they Workers’ Compensation Amendment: Act...,676,1959,2118,2054,8,1442
309,"Statutes Amendment Act, :1944.. --",675,2017,1451,2067,8,776
310,Dec. 15. An Act to ‘make proyision with respec...,416,2084,2121,2158,8,1705
311,: . platters {sections 5-67 amendinents of the...,372,2139,2117,2198,8,1745
312,“section 7: ainendment of the National Provide...,656,2176,2120,2236,8,1464
313,"“of No. 31. Finance Act (No. 3), 1944.",373,2231,1457,2303,8,1084
314,° NORTHERN IRELAND: See United Kingdom of Grea...,321,2270,2118,2411,8,1797
315,and Northern. Ireland: a,368,2374,1357,2454,8,989
316,NORWAY Oe,363,2446,1682,2512,8,1319
317,GOVERNMENT IN OSLO,927,2526,1559,2563,8,632
318,Mar. 30 Act to amend: ‘Provisionally: the ‘Act...,417,2578,2122,2670,8,1705
319,"old age pensions” (NLL. Part I, P. 164; Part I...",652,2636,1931,2727,8,1279
320,We,1906,2710,1950,2727,8,44
321,“oN. L: =N orsh’ Lovtidend:,373,2710,967,2788,8,594
322,"26, Act No. XVI). — “LS. 1942 (Ind. 1, C). “LS...",432,2863,2043,2919,8,1611
323,"ee 1942 (Ind. 4); 1943 (indexes I, p. 10). 1 O...",368,2882,2118,2966,8,1750
324,1927 (Mor. 3); amendments: 1931 (Mor. 1); 1935...,375,2944,2118,3011,8,1743
325,. 11).,397,3012,504,3046,8,107
326,"Pars, 1944 (N.Z. 3). — “Extracts: L.S. 1925 (N...",372,3012,2121,3128,8,1749
327,"(N.Z. 2, A). — “LS. 1936 (N.Z. 2); amendments:...",377,3075,2120,3150,8,1743
328,(N.Z: 1); amendments: 1932 (N.Z. 1): 1936 (NZ....,375,3119,2121,3195,8,1746
329,(N.Z. 3). — *®L.S. 1926 (N.Z. 2); amendments: ...,376,3175,2121,3239,8,1745
330,"(N.Z. 1,-A). — ""LS. 1942 (N.Z.. 1); 1943 (N.Z....",376,3219,2123,3283,8,1747

In [73]:
rec_df.loc[rec_df["page"]==8]

,country,region,text,page
67,FRANCE,,1944--Indexes I — 3 —,8
68,INDIA,,Oct. 7 -An Ordinance further to amend the Nati...,8
69,INDIA,,Dec... 18 | An Ordinance to amend the War Inju...,8
70,MEXICO UNITED STATES OF,,Nov. 4 Decree to amend section 135 [procedure ...,8
71,MEXICO UNITED STATES OF,,’ of the Social Insutance: Act®. (Diario Ofici...,8
72,MOROCCO,,May 1 Decree to amend [sections 21 and 25 of] ...,8
73,MOROCCO,,Dec. 15. An Act to ‘make proyision with respec...,8
74,MOROCCO,,"“of No. 31. Finance Act (No. 3), 1944. ° NORT...",8
75,MOROCCO,and Northern Ireland a,Mar. 30 Act to amend: ‘Provisionally: the ‘Act...,8
76,MOROCCO,“oN L =N orsh’ Lovtidend,"26, Act No. XVI). — “LS. 1942 (Ind. 1, C). “LS...",8

In [43]:
re_d1 = "^[A-Z]([a-z]{2}.?|[a-z]{3}.?) ?[0-9]{1,2}" # example: Nov. 4, July 25

re.search(re_d1, "Nov. 7")

In [25]:
li_df = label.assign_types(lines_df, bins_x0, bins_x1, x0_n)
l = label.assign_labels(li_df, x0_n)
l.head(20)

,line_text,x0,y0,x1,y1,page,dx,x0_type,x1_type,label
0,International Legislative Series,224,236,2041,287,1,1817,0,2,start
1,Labour Office 1987—List No. 3,225,289,2041,324,1,1816,0,2,start
2,LIST OF RECENT LEGISLATION,587,404,1680,456,1,1093,-1,1,other
3,This list indicates the more important enactme...,288,561,2044,603,1,1756,1,2,middle
4,noted in the official gazettes recently receiv...,218,608,1729,651,1,1511,0,1,start
5,"[This cumulative list, arranged in chronologic...",289,655,2044,697,1,1755,1,2,middle
6,1986.],225,703,332,743,1,107,0,0,country
7,ALGERIA,221,837,428,871,1,207,0,0,country
8,1/X/1985 Decree No. 85-243 laying down model r...,225,904,2043,948,1,1818,0,2,start
9,"training. (Journal officiel, 2 Oct.)",286,952,907,995,1,621,1,0,end
10,17/X11/1985 Decree No. 85-306 to establish a g...,224,1021,2043,1064,1,1819,0,2,start
11,attached to the Ministry of higher education. ...,285,1068,1455,1111,1,1170,1,0,end
12,"9/11/1986 National Charter. (ibid., 16 Feb.)",218,1137,1075,1179,1,857,0,0,country
13,[The new National Charter promulgated on 16 Fe...,289,1205,2044,1248,1,1755,1,2,middle
14,a sequel to a number of basic texts adopted si...,285,1252,2043,1296,1,1758,1,2,middle
15,"including the first Charter of 1976, which thi...",286,1299,2044,1343,1,1758,1,2,middle
16,"extend. Like its predecessor, the 1986 Charter...",284,1347,2043,1389,1,1759,1,2,middle
17,rather than a set of detailed rights and oblig...,286,1389,2047,1444,1,1761,1,2,middle
18,Algerian society in some detail. Title 1 then ...,285,1440,2043,1484,1,1758,1,2,middle
19,"socialism, Title 2 the national institutions, ...",286,1487,2043,1529,1,1757,1,2,middle

In [77]:
cli_df, p_l, p_g = correct_x0_types(l, bins_x0, bins_x1, x0_n)
ll_df = label.assign_labels(cli_df, x0_n)
lla_df = approve_correction(l, ll_df)

lli_df = lla_df.copy()
lli_df["new_label"] = lli_df["label"]
lli_df = label.improve_country_classification(lli_df)

lli_df.head(50)

Width median 1318.1190476190477
[(1645.0, 1), (1619.5, 2), (1267.0625, 7)]
Pages small width [7]
Pages big width [1, 2]

,line_text,x0,y0,x1,y1,page,dx,x0_type,x1_type,label,new_label
0,INTERNATIONAL LABOUR OFFICE,199,254,1790,332,1,1591,0,2,other,other
1,"LEGISLATIVE SERIES, 1921",223,1201,1748,1363,1,1525,1,1,start,start
2,(PARTS I AND ID),695,1404,1292,1469,1,597,-1,0,other,other
3,INDEXES,793,2040,1192,2113,1,399,-1,0,other,other
4,"GENEVA, SWITZERLAND",640,3143,1346,3191,1,706,2,1,end,end
5,Price: 8 d.,145,3238,413,3278,1,268,-1,0,other,other
6,INTERNATIONAL LABOUR OFFICE,465,268,1998,325,2,1533,0,1,other,other
7,"(GENEVA, SWITZERLAND)",908,373,1548,419,2,640,-1,0,other,other
8,"LEGISLATIVE SERIES, 1921",601,967,1842,1053,2,1241,2,1,end,end
9,(PARTS 1 AND II),977,1080,1486,1143,2,509,-1,0,other,other
10,INDEXES,1128,1648,1334,1685,2,206,-1,0,other,other
11,I. Chronological Indexes: ~ ; ; . Page,485,1712,2083,1756,2,1598,0,2,other,other
12,A. Laws and Orders C0) aD 00 2p Ga 2,535,1774,2082,1828,2,1547,1,2,start,start
13,"B. Laws and Orders of years previous to 1921, ...",536,1837,2008,1875,2,1472,1,1,start,start
14,part or summarised in connection with Laws and...,603,1892,2083,1940,2,1480,2,2,middle,middle
15,"TI, Subject Index 2... 0... ccc ec tet eee e n...",464,1952,2083,1999,2,1619,-1,2,other,other
16,List of Errata occ eee ee ee eee ene n ence ee...,463,2086,2084,2122,2,1621,-1,2,other,other
17,"Exim. BirKu&user & Co., Printers, Basle.",819,3210,1646,3259,2,827,-1,1,other,other
18,I. CHRONOLOGICAL INDEX OF LAWS AND ORDERS IN THE,117,405,1828,446,3,1711,0,1,other,other
19,ENGLISH EDITION OF THE LEGISLATIVE SERIES OF,117,475,1828,517,3,1711,0,1,other,other
20,"THE INTERNATIONAL LABOUR OFFICE, rg2r.",316,547,1620,599,3,1304,-1,1,other,other
21,"Note.—T., E., S., or Tl. after the title of a ...",175,642,1827,681,3,1652,-1,1,other,other
22,"text, an extract, a summary, or the title only...",122,690,1828,727,3,1706,0,1,other,other
23,The letters and unbracketed numbers given afte...,172,738,1832,774,3,1660,-1,1,other,other
24,"the Legislative Series for 1921, which may be ...",122,785,1830,822,3,1708,0,1,other,other
25,in question or in referring to the Series for ...,121,830,1832,870,3,1711,0,1,other,other
26,refer to pages in the particular issues of the...,125,879,1126,918,3,1001,0,1,other,other
27,"The Legislative Series, 1921, having been issu...",176,926,1827,965,3,1651,-1,1,other,other
28,are indicated by II preceding the abbreviated ...,124,974,1440,1012,3,1316,0,2,other,other
29,A. Laws AnD ORDERS OF 1921.,657,1081,1274,1116,3,617,-1,1,other,other
30,ENTERNATIONAL,127,1128,417,1156,3,290,0,0,country,country
31,Feb. 9th. Convention respecting insurance agai...,209,1185,1439,1222,3,1230,1,2,start,start
32,cupational accidents concluded at the Hague,508,1232,1440,1269,3,932,2,2,middle,middle
33,between Belgium and the Netherlands. T. ... In...,509,1280,1603,1316,3,1094,2,1,end,end
34,Feb. 14th Convention between France and Belgiu...,212,1326,1443,1364,3,1231,1,2,start,start
35,the purpose of guaranteeing to their nationals,515,1373,1443,1412,3,928,2,2,middle,middle
36,working in French or Belgian mines the advanta...,512,1421,1443,1458,3,931,2,2,middle,middle
37,of the special system of miners’ pensions in f...,513,1468,1443,1506,3,930,2,2,middle,middle
38,in each country. T. ..... 0... . eee ee eee ee...,513,1516,1602,1553,3,1089,2,1,end,end
39,Mar. 4/16th Agreecinent respecting the treatme...,215,1561,1446,1605,3,1231,1,2,start,start
40,nationals in Switzerland and Swiss nationals in,515,1610,1446,1640,3,931,2,2,middle,middle
41,Italy in respect of unemployment benefit (ex-,514,1657,1444,1694,3,930,2,2,middle,middle
42,change of Notes between the Italian Legation at,511,1704,1450,1741,3,939,2,2,middle,middle
43,Berne and the Swiss Federal Department of,513,1745,1443,1789,3,930,2,2,middle,middle
44,National Economy). T. ............. eee eeuee ...,513,1795,1602,1841,3,1089,2,1,end,end
45,Oct. 8th Convention between Italy and the Unit...,215,1846,1446,1884,3,1231,1,2,start,start
46,of Brazil respecting emigration and employment...,512,1889,1662,1937,3,1150,2,1,end,end
47,ARGENTINE,129,1953,343,1983,3,214,0,0,country,country
48,June 8th Act respecting matches manufactured’ ...,215,2012,1440,2049,3,1225,1,2,start,start
49,poisonous phosphorus. T. ...........-20.0- 000...,511,2055,1668,2101,3,1157,2,1,end,end

In [78]:
l.loc[lli_df["page"]==7]

,line_text,x0,y0,x1,y1,page,dx,x0_type,x1_type,label
257,—_—~ 7 ee,899,229,1159,273,7,260,-1,1,other
258,Aug. 19th Act to provide for the reorganisatio...,270,342,1499,380,7,1229,1,2,start
259,regulation of railways and the discharge of,568,389,1496,428,7,928,2,2,middle
260,liabilities arising in connection with the pos...,568,437,1508,474,7,940,2,2,middle
261,"of railways, and otherwise to amend the Law",568,484,1496,522,7,928,2,2,middle
...,...,...,...,...,...,...,...,...,...,...
313,"Dec, 31st The Workmen’s Compensation (Twister’...",260,3023,1492,3061,7,1232,1,2,start
314,"Order, 1921, made by the Secretary of State",564,3071,1495,3108,7,931,2,2,middle
315,under section 8 of the Worknicn’s Compensation,564,3117,1493,3155,7,929,2,2,middle
316,"Act, rg06 (6 Edw. 7, c. 58)*. To. oe. eee eee ...",564,3167,1807,3204,7,1243,2,1,end
317,* Sec also list of Laws and Orders of vears pr...,229,3248,1707,3285,7,1478,0,1,other

In [79]:
ll_df.loc[lli_df["page"]==7]

,line_text,x0,y0,x1,y1,page,dx,x0_type,x1_type,label
257,—_—~ 7 ee,899,229,1159,273,7,260,-1,1,other
258,Aug. 19th Act to provide for the reorganisatio...,270,342,1499,380,7,1229,1,2,start
259,regulation of railways and the discharge of,568,389,1496,428,7,928,2,2,middle
260,liabilities arising in connection with the pos...,568,437,1508,474,7,940,2,2,middle
261,"of railways, and otherwise to amend the Law",568,484,1496,522,7,928,2,2,middle
...,...,...,...,...,...,...,...,...,...,...
313,"Dec, 31st The Workmen’s Compensation (Twister’...",260,3023,1492,3061,7,1232,1,2,start
314,"Order, 1921, made by the Secretary of State",564,3071,1495,3108,7,931,2,2,middle
315,under section 8 of the Worknicn’s Compensation,564,3117,1493,3155,7,929,2,2,middle
316,"Act, rg06 (6 Edw. 7, c. 58)*. To. oe. eee eee ...",564,3167,1807,3204,7,1243,2,1,end
317,* Sec also list of Laws and Orders of vears pr...,229,3248,1707,3285,7,1478,0,1,other

In [80]:
rec_gr = records.group_records(lli_df)
rec = records.extract_records(lli_df)
rec.head(20)

,country,region,text,page
0,ENTERNATIONAL,,Feb. 9th. Convention respecting insurance agai...,3
1,ENTERNATIONAL,,Feb. 14th Convention between France and Belgiu...,3
2,ENTERNATIONAL,,Mar. 4/16th Agreecinent respecting the treatme...,3
3,ENTERNATIONAL,,Oct. 8th Convention between Italy and the Unit...,3
4,ARGENTINE,,June 8th Act respecting matches manufactured’ ...,3
5,AUSTRIA,,Mar. 1oth Act respecting the regulation of emp...,3
6,AUSTRIA,,Mar. 11th Act to amend certain provisions of t...,3
7,AUSTRIA,,Mar. 22nd Act concerning the regulation of agr...,3
8,AUSTRIA,,May 11th Act relating to the contract of servi...,3
9,AUSTRIA,,June rst Act concerning the regulation of empl...,3
10,AUSTRIA,,July r4th Act relating to industrial inspectio...,3
11,AUSTRIA,,Aug. r2th Order respecting a special industria...,3
12,AUSTRIA,,Aug. r2th Order of the Ministry of Social Admi...,3
13,AUSTRIA,,Aug. 12th Decree issued by the Ministry of Soc...,3
14,BELGIUM,,May 24th Act to repeal Section 310 of the Pena...,4
15,BELGIUM,,May 24th Act to guarantec freedom of associati...,4
16,BELGIUM,,June 14th Act to provide for an eight-hour day...,4
17,BELGIUM,,"Aug. 7th Act of 24th December, 1903, respectin...",4
18,BELGIUM,BraziL,Jan. 6th Deerce regulating alien immigration i...,4
19,CHILE,,Mar. 22nd Regulations for the administration o...,4

In [82]:
rec.loc[rec["page"]==6]

,country,region,text,page
57,FRANCE,,Ort. 30th Decree to amend the Decree of 26th A...,6
58,GERMANY,,Feb. ist Order No. 7968 to prohibit the manufa...,6
59,GERMANY,,"Feb, 2nd Order respecting the painting of ship...",6
60,GERMANY,,Feb. 5th Act respecting the works balance-shee...,6
61,GERMANY,,Apr. 11th Act to amend the law relating to acc...,6
62,GERMANY,,July zoth Act respecting maternity benefit and...,6
63,(BREMEN),,July 17th Act respecting the Council of Wage-c...,6
64,(BREMEN),,July x7th Act respecting theCouncil of Salarie...,6
65,(BREMEN),(Prussia),"Jan, 31st Order providing for (1) the amendmen...",6
66,(BREMEN),(Prussia),july rst Act to vary the rates of contribution...,6
67,(BREMEN),(Prussia),Aug. roth Act to repeal the Corn Production Ac...,6
68,(BREMEN),(Prussia),Aug. 19th Act to consolidate the enactinents r...,6
69,GREAT BRITAIN,,Mar. 3rd Act to provide for an increase of the...,6
70,GREAT BRITAIN,,Mar. 3rd Order madc by the Secretary of State ...,6

In [18]:
rec.to_csv("index_1986.csv")

In [44]:
# correct x0_type for pages where something went wrong
def correct_x0_types(lines_df, bins_x0, bins_x1, x0_n):
    df = lines_df.copy()
    start_page = lines_df["page"].min()

    text_widths = list(lines.make_borders_df(bins_x0, bins_x1)["dx"]) # difference between mean of first and last bin for x0 for every page

    tw = text_widths.copy()
    tw.sort()
    width_median = tw[int(len(tw)/2)]
    print("Width median", width_median)

    f = filter(lambda w: (not util.similar_to(w, width_median, 10)), text_widths) # filter widths that differ from the rest
    f = list(f)

    p = []
    for w in range(len(f)):
        p.append((f[w], text_widths.index(f[w]) + start_page)) # add page to strange width
    
    print(p)

    p_l = [a for w, a in p if w<width_median]
    p_g = [a for w, a in p if w>width_median]
    
    print("Pages small width", p_l)
    print("Pages big width", p_g)

    df.loc[df["page"].isin(p_l) & (df["x0_type"]>=0), "x0_type"] +=1 # correct wrong x0_type for p_l

    # correct wrong x0_type (and x1_type) for p_g
    bins = group.get_line_start_end_bins(df.loc[df["page"].isin(p_g)])
    bins_x0_cor = group.get_relevant_x0_bins(bins[0], x0_n, drop_first=True) # drop bin on the very left
    df_cor = label.assign_types(df.loc[df["page"].isin(p_g)], bins_x0_cor, bins_x1.loc[bins_x1["page"].isin(p_g)], x0_n)
    df.loc[df["page"].isin(p_g), ["x0_type", "x1_type"]] = df_cor[["x0_type", "x1_type"]]

    return df, p_l, p_g

In [17]:
for i, file in enumerate(indexes_csv):
    save_path = output_dir + os.sep + os.path.basename(file)
    extract.extract_indexes(pd.read_csv(file), save_to=save_path)

Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1976.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1977.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1978.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1979.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1981.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1982.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_Index_1983.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1983_Spanish.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1984.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1985-1.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1986.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1987.csv.
Saved extracted indexes to H:\Documents\Indexex\ILO_yearly_indices\extracted_indexes\LS_index_1988_Spanish.csv.

## Probleme
- Dokumente mit 2 Spalten
- Dokumente mit Länder-Überschrift über ganze Breite der Seite
- Länder- und Regionenspalte vereinen?
    - Regionenerkennung oft nicht richtig, weil Groß- und Kleinbuchstaben vom OCR nicht richtig erkannt werden
- Dokumente/Seiten mit vielen Artifakten
    - 1944
        - S. 8-9, schlechte Ländererkennung
        - S. 25 falsches Labeling
        - S. 28 Inhalt fehlt?
    

## Fragen
- Kommandozeilenprogramm